Revit 2024 API
ColorFillScheme.CanDefineByRange Method
 Checks whether the scheme entries can be explained by range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public bool CanDefineByRange()
Visual Basic
Public Function CanDefineByRange As Boolean
Visual C++
public:
bool CanDefineByRange()
Return Value
 Returns true ifthe scheme entries can be explained by range, false otherwise.
See Also
ColorFillScheme Class
Autodesk.Revit.DB Namespace